Revit 2027 API
PointCloudColorSettings Constructor
 Constructs color settings object with default colors.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PointCloudColorSettings()
Public Sub New
public:
PointCloudColorSettings()
new : unit -> PointCloudColorSettings
See Also
Reference
PointCloudColorSettings Class
PointCloudColorSettings Overload
Autodesk.Revit.DB.PointClouds Namespace